Revit 2022 API
PointLoad.Create Method
Overload List
Name | Description
Create(Document, AnalyticalModel, XYZ, XYZ, PointLoadType)
 Creates a new hosted point load within the project.
Create(Document, AnalyticalModelStick, AnalyticalElementSelector, XYZ, XYZ, PointLoadType)
 Creates a new hosted point load within the project.
Create(Document, XYZ, XYZ, XYZ, PointLoadType, SketchPlane)
 Creates a new non-hosted point load within the project using data at point.
See Also
PointLoad Class
PointLoad Members
Autodesk.Revit.DB.Structure Namespace